[
    {
        "merchantName": "PITAKA",
        "endDate": "NEVER",
        "title": "25% OFF for Air Case for iPhone 13 seires",
        "trackingURL": "https://www.shareasale.com/u.cfm?d=995801&m=68966&u=233101",
        "category": "PITAKA Case",
        "description": "The thinnest and lightest iPhone 13 case made using Fusion Weaving aramid fiber. Unique styles created using Fusion Weaving technique Lightweight and ultra-thin Textured surface for exceptional grip and comfort Precision cut for access to buttons, switches, and the charging port Lifted camera ring Free MagSafe Ring (to make the Air Case MagSafe compatible)",
        "couponCode": "25%OFF-i13SAS"
    },
    {
        "merchantName": "PITAKA",
        "endDate": "NEVER",
        "title": "25% OFF for MagEZ Case 2 for iPhone 13 series",
        "trackingURL": "https://www.shareasale.com/u.cfm?d=995792&m=68966&u=233101",
        "category": "PITAKA Case",
        "description": "A slim yet durable MagSafe compatible case with unique styles. Unique styles created using Fusion Weaving technique MagSafe compatible Textured surface for exceptional grip and comfort Precision cut for access to buttons, switches, and the charging port Lifted camera ring",
        "couponCode": "25%OFF-i13SAS"
    },
    {
        "merchantName": "PITAKA",
        "endDate": "NEVER",
        "title": "25% OFF for Samsung Galaxy S22 series cases",
        "trackingURL": "https://www.shareasale.com/u.cfm?d=995811&m=68966&u=233101",
        "category": "PITAKA Case",
        "description": "A slim yet durable S22 case with MagSafe compatibility. Built-in MagSafe magnets Works with MagEZ 2.0 accessories including MagEZ Slider Tactile, nonslip surface Lifted camera ring Robust and light",
        "couponCode": "25%OFF-S22SAS"
    },
    {
        "merchantName": "PITAKA",
        "endDate": "NEVER",
        "title": "15% OFF for MagEZ Case 3 for iPhone 14 series",
        "trackingURL": "https://www.shareasale.com/u.cfm?d=995791&m=68966&u=233101",
        "category": "PITAKA Case",
        "description": "The thinnest and lightest MagSafe compatible aramid fiber phone case. Thin (min. thinness 0.95mm) and lightweight (min. weight 17.3g) Skin-friendly 3D grip MagSafe and MagEZ 2.0 compatible Made using durable yet lightweight aramid fiber Raised lip for camera protection",
        "couponCode": "15%OFF-i14SAS"
    }
]